package chapter11_arrays;
/*
    배열의 필요성:
        여태까지의 수업을 기준으로 하면 10개의 정수형 데이터를 저장하려면  int 변수형
        10개 선언해서 저장해야 합니다.
        배열은 같은 자료형의 데이터를 하나의 변수에 저장해서 처리하는 방식입니다.
            -> 추후 다른 자료들을 하나의 변수에 저장하는 방식도 수업 할 예정.


 */
public class ArrayTest01 {
    public static void main(String[] args) {

    int[] arr1 = new int[10];       // 배열 선언 방식 1 -> 배열을 선언만 하고 값은 나중에 대입
    int[] arr2 = {1,2,3,4,5};       // 배열 선언 방식 2 -> 배열 선언 및 초기화

        /*

        나머지는 20250213 수업 예정
         */

    }
}
